<aside class="list-aside comment-aside">
    <details>
        <summary style="font-size: 11px;">
            <h3>コメントの例文ガイドを読む</h3>
        </summary>
        <ol>
            <li>
                <p class="summary-p">
                    <b>ルームの特徴や魅力を共有する</b><br>「いつも面白い最新情報が投稿されるので、楽しんで参加しています。明るい雰囲気で話しやすいところも魅力です！」
                </p>
            </li>
            <li>
                <p class="summary-p">
                    <b>体験談を語る</b><br>「DIYについてのアドバイス尋ねたところ、誰かが必要な材料や工具などの詳細を教えてくれました。わかりやすく教えていただけて、無事に組み立てることができました！」
                </p>
            </li>
            <li>
                <p class="summary-p">
                    <b>感謝や称賛を述べる</b><br>「相談しやすいように配慮された管理をしてくれているおかげで、皆さんが親身に話を聞いてくれるので、日常の支えになっています。いつもありがとうございます。」
                </p>
            </li>
            <li>
                <p class="summary-p">
                    <b>新規参加者へのアドバイスを含める</b><br>「新規で参加される方には、好きなゲームなどの自己紹介から始めることをお勧めします。皆さんからの反応は暖かいので、すぐに馴染むことができると思います！」
                </p>
            </li>
        </ol>
        <p class="summary-p" style="font-size: 11px; color: #b7b7b7">
            コメントは検索エンジン（Googleなど）に随時読み込まれています。ユーザーの体験に基づくコメントの掲載は、検索エンジンによって高く評価されます。このオプチャ自体が高く評価されることにより、様々なキーワードの検索結果に上位掲載される機会が増えます。これにより、外部から新しい訪問者を呼び込むことができます。
        </p>
    </details>
</aside>