import { langCode } from './config'

const translation = {
  オプチャグラフ: {
    tw: 'LINE社群圖表',
    th: 'โอเพนแชท กราฟ',
  },
  検索: {
    tw: '搜尋',
    th: 'ค้นหา',
  },
  閉じる: {
    tw: '關閉',
    th: 'ปิด',
  },
  オープンチャットを検索: {
    tw: '搜尋社群聊天室',
    th: 'ค้นหา โอเพนแชท',
  },
  '【最新】': {
    tw: '【最新】',
    th: '【ล่าสุด】',
  },
  '人数増加・1週間': {
    tw: '人數增加・1週',
    th: 'การเพิ่มจำนวนคน・1 สัปดาห์',
  },
  '人数増加・24時間': {
    tw: '人數增加・24小時',
    th: 'การเพิ่มจำนวนคน・24 ชั่วโมง',
  },
  '人数増加・1時間': {
    tw: '人數增加・1小時',
    th: 'การเพิ่มจำนวนคน・1 ชั่วโมง',
  },
  参加人数のランキング: {
    tw: '參加人數排行榜',
    th: 'อันดับจำนวนผู้เข้าร่วม',
  },
  通信エラー: {
    tw: '通信錯誤',
    th: 'ข้อผิดพลาดการสื่อสาร',
  },
  オープンチャットのカテゴリータブ: {
    tw: '社群聊天室分類標籤',
    th: 'แท็บหมวดหมู่ โอเพนแชท',
  },
  並び順: {
    tw: '排序',
    th: 'เรียง',
  },
  増加数が多い順: {
    tw: '增加數量多的順序',
    th: 'ลำดับตามจำนวนที่เพิ่มขึ้นมาก',
  },
  増加数が少ない順: {
    tw: '增加數量少的順序',
    th: 'ลำดับตามจำนวนที่เพิ่มขึ้นน้อย',
  },
  増加率が高い順: {
    tw: '增加率高的順序',
    th: 'ลำดับตามอัตราการเพิ่มขึ้นที่สูง',
  },
  増加率が低い順: {
    tw: '增加率低的順序',
    th: 'ลำดับตามอัตราการเพิ่มขึ้นที่ต่ำ',
  },
  メンバー数が多い順: {
    tw: '成員數量多的順序',
    th: 'ลำดับตามจำนวนสมาชิกที่มาก',
  },
  メンバー数が少ない順: {
    tw: '成員數量少的順序',
    th: 'ลำดับตามจำนวนสมาชิกที่น้อย',
  },
  '表示対象はメンバー数が10人以上で公式ランキングに掲載中のルームです。': {
    tw: '顯示對象是有10人以上成員且在官方排名中的房間。',
    th: 'ห้องที่แสดงมีสมาชิกมากกว่า 10 คนและอยู่ในการจัดอันดับอย่างเป็นทางการ',
  },
  '１週間以上メンバー数に変動がないルームは除外されます。': {
    tw: '排除一周以上沒有變動的房間。',
    th: 'ห้องที่ไม่มีการเปลี่ยนแปลงจำนวนสมาชิกมากกว่าหนึ่งสัปดาห์จะถูกตัดออก',
  },
  '表示対象は公式ランキングに掲載されているルーム、または過去に掲載されたことがあるルームで、メンバーが10名以上いるルームです。':
    {
      tw: '顯示對象是在官方排名中或曾經被列入的房間，且有10人以上成員。',
      th: 'ห้องที่แสดงเป็นห้องที่มีสมาชิก 10 คนขึ้นไปและอยู่ในการจัดอันดับอย่างเป็นทางการหรือเคยจัดอันดับไว้',
    },
  '表示対象はメンバー数が10人以上のルームです。': {
    tw: '顯示對象是有10人以上成員的房間。',
    th: 'ห้องที่แสดงมีสมาชิกมากกว่า 10 คน',
  },
  '直近１週間分の統計データがまだ無いルームと、１週間以上メンバー数に変動がないルームは除外されます。':
    {
      tw: '最近一週的統計數據還沒有的房間，以及一周以上沒有變動的房間將被排除。',
      th: 'ห้องที่ไม่มีข้อมูลสถิติในอาทิตย์ล่าสุดและห้องที่ไม่มีการเปลี่ยนแปลงจำนวนสมาชิกมากกว่าหนึ่งสัปดาห์จะถูกตัดออก',
    },
  '表示対象は公式ランキングに掲載されているルーム、または過去に掲載されたことがあるルームです。': {
    tw: '顯示對象是在官方排名中或曾經被列入的房間。',
    th: 'ห้องที่แสดงเป็นห้องที่อยู่ในการจัดอันดับอย่างเป็นทางการหรือเคยจัดอันดับไว้',
  },
  '表示対象は全てのルームです。': {
    tw: '顯示對象是所有房間。',
    th: 'ห้องที่แสดงเป็นห้องทั้งหมด',
  },
  メンバー増加: {
    tw: '人數增加',
    th: 'จำนวนคนเพิ่มขึ้น',
  },
  '1時間': {
    tw: '1小時',
    th: '1H',
  },
  過去24時間: {
    tw: '過去24小時',
    th: '24 ชั่วโมงที่ผ่านมา',
  },
  '1週間': {
    tw: '1週',
    th: '1W',
  },
  '24時間': {
    tw: '24小時',
    th: '24H',
  },
  人数: {
    tw: '人數',
    th: 'จำนวนคน',
  },
  その他: {
    tw: '其他',
    th: 'อื่นๆ',
  },
}

const sprintfTranslation = {
  '「%s」の検索結果': {
    ja: (s: string) => `「${s}」の検索結果`,
    tw: (s: string) => `「${s}」的搜尋結果`,
    th: (s: string) => `ผลการค้นหา "${s}"`,
  },
  '%s 件': {
    ja: (s: string) => `${s} 件`,
    tw: (s: string) => `${s} 項`,
    th: (s: string) => `${s} รายการ`,
  },
  '%s 件中 %s 件目～': {
    ja: (s: string, s2: string) => `${s} 件中 ${s2} 件目～`,
    tw: (s: string, s2: string) => `${s} 項中的第 ${s2} 項～`,
    th: (s: string, s2: string) => `${s2} จาก ${s} รายการ ~`,
  },
  'メンバー %s人': {
    ja: (s: string) => `メンバー ${s}人`,
    tw: (s: string) => `成員${s}`,
    th: (s: string) => `สมาชิก ${s}`,
  },
}

export const sprintfT = (key: string, ...string: (string | number)[]): string => {
  // @ts-ignore
  return sprintfTranslation[key]?.[langCode ? langCode : 'ja'](...string) ?? key
}

export const t = (string: string): string => {
  // @ts-ignore
  return translation[string]?.[langCode] ?? string
}

export const formatMember = (n: number) => {
  if (!langCode) {
    return n < 1000 ? n : n >= 10000 ? (n / 10000).toFixed(1) + '万' : n.toLocaleString()
  }

  return n.toLocaleString()
}
